package exercise1;

public enum HTTPError {
	HTTP400(" Неправильний запит. Запит не може бути виконаний з причини невірного синтаксису."), 
	HTTP401("Несанкціонований доступ. Схожа на 403 Forbidden, але використовується спеціально у разі необхідності аутентифікації користувача, яка відбулася невдало, або ще не відбулася перед запитом ресурсу."),
	HTTP402("Потрібна оплата. Зарезервовано для майбутнього використання. Спочатку передбачалося, що цей код може бути використаний, як частина схеми безготівкової оплати через мережу, але цього не сталося, і цей код зазвичай не використовується. YouTube використовує цей статус, якщо з конкретної IP-адреси зробили надмірну кількість запитів і вимагає від людини ввести CAPTCHA.");
	 


	private final String info;

	HTTPError(String info) {
		this.info = info;
	}

	public String getHTTP() {
		return info;
	}

	
	
}
